
export const dataDictionary = {
    //  地区
    areaMap: {
        '北京': 0,
        '上海': 0,
        '深圳': 0,
        '广州': 0,
        '杭州': 0,
        '其他': 0
    },
    //  最低学历要求
    education: {
        '博士': 0,
        '硕士': 0,
        '本科': 0,
        '大专': 0,
        '其他': 0
    },
    //  薪酬水平 - 年薪
    reward: {
        '10万以下': 0,
        '10-19万': 0,
        '20-29万': 0,
        '30-39万': 0,
        '40-49万': 0,
        '50-59万': 0,
        '60-69万': 0,
        '70-79万': 0,
        '80-99万': 0,
        '100万以上': 0,
        '面议': 0
    },
    //  公司标签 - 只按照标签计算，会超过总工作数，初步预估总标签数是总工作数的几倍
    companyTag: {
        '股票期权': 0,
        '带薪年假': 0,
        '弹性工作': 0,
        '年度旅游': 0,
        '节日礼物': 0,
        '交通补助': 0,
        '五险一金': 0,
        '六险一金': 0,
        '七险一金': 0,
        '团队聚餐': 0,
        '定期体检': 0,
        '休闲餐点': 0,
        '休闲餐点': 0,
        '500强': 0,
        '外派津贴': 0,
        '周末双休': 0,
        '免费班车': 0,
        '领导好': 0,
        '老板NICE': 0,
        '扁平管理': 0,
        '人性化管理': 0,
        '住房补贴': 0,
        '年底双薪': 0,
        '上市公司': 0,
        '公司规模大': 0,
        '发展空间大': 0,
        '美资企业': 0,
        '不加班': 0
    },
    //  不同级别岗位分析，如初中级、高级、资深、前端专家
    rank: {
        '初中级': 0,
        '高级': 0,
        '资深': 0,
        '前端专家': 0
    }
}
